app/views/genres/show.html.erb

SELECT "movies".* FROM "movies" INNER JOIN "characterizations" ON "movies"."id" = "characterizations"."movie_id" WHERE "characterizations"."genre_id" = ?  [["genre_id", 5]]
---
  <ul>
    <% @genre.movies.each do |movie| %>