app/views/movies/_form.html.erb

SELECT "genres".* FROM "genres"
---
  <div class="checkboxes">
    <%= f.collection_check_boxes(:genre_ids, Genre.all, :id, :name) %>