app/controllers/application_controller.rb

  def require_correct_user
    @user = User.find_by!(username: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jgrabenbauer"], ["LIMIT", 1]]