app/controllers/genres_controller.rb

  def set_genre
    @genre = Genre.find_by!(slug: params[:id])
---
SELECT "genres".* FROM "genres" WHERE "genres"."slug" = ? LIMIT ?  [["slug", "suspense"], ["LIMIT", 1]]