app/controllers/movies_controller.rb

SELECT "genres".* FROM "genres" INNER JOIN "characterizations" ON "genres"."id" = "characterizations"."genre_id" WHERE "characterizations"."movie_id" = ?  [["movie_id", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = ? LIMIT ?  [["user_id", 1], ["movie_id", 1], ["LIMIT", 1]]
---
  def show
    @review = @movie.reviews.new
    @fans = @movie.fans
    @genres = @movie.genres
    if current_user
      @favorite = current_user.favorites.find_by(movie_id: @movie.id)

UPDATE "movies" SET "updated_at" = ? WHERE "movies"."id" = ?  [["updated_at", "2021-03-23 16:01:54.721184"], ["id", 1]]
---
  def update
    if @movie.update movie_params