app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("stars", "comment", "movie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["stars", 5], ["comment", "Yesssssssss!!!"], ["movie_id", 7], ["created_at", "2021-03-29 20:59:57.762179"], ["updated_at", "2021-03-29 20:59:57.762179"], ["user_id", 1]]
---
  def create
    @review = @movie.reviews.new(review_params)
    @review.user = current_user
    if @review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? ORDER BY "reviews"."created_at" DESC LIMIT ?  [["movie_id", 7], ["id", 6], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 6]]
---
  def destroy
    @review = @movie.reviews.find(params[:id])
    @review.destroy

SELECT "movies".* FROM "movies" WHERE "movies"."slug" = ? LIMIT ?  [["slug", "captain-marvel"], ["LIMIT", 1]]
---
  def set_movie
    @movie = Movie.find_by!(slug: params[:movie_id])