app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "jgrabenbauer"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params[:email_or_username]) ||
            User.find_by(username: params[:email_or_username])