app/views/reviews/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? ORDER BY "reviews"."created_at" DESC  [["movie_id", 2]]
---

  <% if @movie.reviews.present? %>